// * # Q U E E N  👑


class KeysConfig {
  KeysConfig._();

  //* constant data
  static const selectStage ="اختر الصفوف التي ترغب في دراستها";
  static const selectMore = "(يمكنك اختيار أكثر من صف )";
  static const token ='SelectedStagesClasses';
static const kMessageToKnow = '* We will send you a message to set or reset your new password soon .. please await .. !';

static const kLoramText ='تعتبر مكتبة الحرم المكي الشريف أحد الصروح العلمية الثقافية بمكة المكرمة (العاصمة المقدسة) التي تواصلت مع روادها لسنين مضت حيث تفاعلت معهم بما هيأته لهم من أوعية معلومات بأشكال مختلفة وما تقدمه لهم طيلة أيام الأسبوع على فترتين صباحية ومسائية وبخدمات متنوعة تتواكب والمستجدات الحديثة مما جعلها ترقى لأن تصبح بتوفيق الله إحدى أهم المكتبات لاقتران اسمها بأطهر البقاع قاطبة ومهوى أفئدة المسلمين. وبما تقدمه من خدمات للباحثين والقراء وطالبي العلم والحجاج والمعتمرين ، وللنساء كذلك نصيبهن أسوة بالرجال واستثمرت المكتبة ما حباها الله من إمكانات ومميزات فعملت على تطوير خدماتها وتأهيل منسوبيها لتواكب النهضة التي تعيشها بلادنا في كافة المجالات ولتسير جنباً إلى جنب مع وضيفاتها بقية المكتبات ومراكز المعلومات وسخرت ذلك كله لروادها للنهل من معينها.';
  static  String kToken='' ;

}

class GetSelectedList{
  // static List<Classes> getList(){
  //   final map2 = LocalStorage.getMap(KeysConfig.token);
  //   final List<Classes> selectedClassesList =[];
  //   map2.forEach((key, value) {
  //     selectedClassesList.add(Classes(id: int.parse(key), name: value));
  //   });
  //   return selectedClassesList;
  // }
}
